#!/usr/bin/env brew bundle
#
# require:
#   brew tap homebrew/bundle
# execute with:
#   brew bundle
#

## Taps

tap "homebrew/bundle"             # https://github.com/Homebrew/homebrew-bundle
tap "caskroom/cask"               # https://github.com/caskroom/homebrew-cask
tap "caskroom/fonts"              # https://github.com/caskroom/homebrew-fonts
tap "fisherman/tap"               # https://github.com/fisherman/homebrew-tap

## Brew Packages

brew "fish"                       # https://fishshell.com
brew "fisherman"                  # https://github.com/fisherman/fisherman
brew "go"                         # https://golang.org
brew "tig"                        # http://jonas.nitro.dk/tig/
brew "vim"                        # http://www.vim.org/
brew "pstree"                     # http://www.thp.uni-duisburg.de/pstree/
brew "htop"                       # https://hisham.hm/htop/
brew "android-platform-tools"     # https://developer.android.com/sdk
brew "pandoc"                     # http://pandoc.org
brew "tree"                       # http://mama.indstate.edu/users/ice/tree/
brew "mtr"                        # http://www.bitwizard.nl/mtr/
brew "dtrx"                       # http://brettcsmith.org/2007/dtrx/
brew "git"                        # https://git-scm.com
brew "git-flow"                   # https://github.com/nvie/gitflow
brew "gibo"                       # https://github.com/simonwhitaker/gibo
brew "mercurial"                  # https://www.mercurial-scm.org/
brew "nodejs"                     # https://nodejs.org/
brew "coreutils"                  # https://www.gnu.org/software/coreutils/
brew "gnu-indent"                 # https://www.gnu.org/software/indent/
brew "gnu-sed"                    # https://www.gnu.org/software/sed/sed
brew "wget"                       # https://www.gnu.org/software/wget/
brew "most"                       # http://www.jedsoft.org/most/
brew "asciinema"                  # https://asciinema.org/
brew "iftop"                      # http://www.ex-parrot.com/pdw/iftop/
brew "moreutils"                  # https://joeyh.name/code/moreutils/
brew "nmap"                       # https://nmap.org/
brew "autoconf"                   # https://www.gnu.org/software/autoconf/autoconf.html
brew "grc"                        # http://kassiopeia.juls.savba.sk/~garabik/software/grc.html
brew "python3"                    # https://www.python.org/
brew "pyenv"                      # https://github.com/yyuu/pyenv
brew "packer"                     # https://packer.io/
brew "bash"                       # https://www.gnu.org/software/bash/ for bash >= v4
brew "apg"                        # password generator [http://www.adel.nursat.kz/apg/]
brew "qemu"                       # http://wiki.qemu.org/Main_Page
brew "pv"                         # https://www.ivarch.com/programs/pv.shtml
brew "jq"                         # https://stedolan.github.io/jq/
brew "awscli"                     # https://github.com/aws/aws-cli

## Casks

cask "font-monofur"               # http://www.dafont.com/monofur.font
cask "mongohub"                   # https://github.com/jeromelebel/MongoHub-Mac
cask "devcenter"                  # http://www.planetcassandra.org/devcenter/
cask "horndis"                    # http://joshuawise.com/horndis
cask "flash"                      # https://get.adobe.com/flashplayer/
cask "android-file-transfer"      # https://android.com/filetransfer/
cask "wireshark"                  # https://www.wireshark.org/
cask "tuntap"                     # http://tuntaposx.sourceforge.net/faq.xhtml
