TeddyDD.fish
auiworks.amvim
ban.spellright
bradymholt.pgformatter
bungcip.better-toml
chrmarti.ssh
coolbear.systemd-unit-file
eamodio.gitlens
emmanuelbeziat.vscode-great-icons
fcrespo82.markdown-table-formatter
file-icons.file-icons
fireyy.vscode-language-todo
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
HookyQR.beautify
James-Yu.latex-workshop
kleber-swf.ocean-dark-extended
lunaryorn.fish-ide
mechatroner.rainbow-csv
ms-vscode.Go
patrys.vscode-code-outline
PeterJausovec.vscode-docker
quicktype.quicktype
richie5um2.vscode-sort-json
shanoor.vscode-nginx
sidneys1.gitconfig
timonwong.shellcheck
vinzi.wordscounter
wengerk.highlight-bad-chars
yzhang.markdown-all-in-one
zxh404.vscode-proto3
