aaron-bond.better-comments
aleksandra.go-group-imports
attilabuti.vscode-mjml
auiworks.amvim
Compilenix.vscode-zonefile
coolbear.systemd-unit-file
DavidAnson.vscode-markdownlint
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
file-icons.file-icons
foxundermoon.shell-format
golang.go
GrapeCity.gc-excelviewer
jeff-hykin.better-dockerfile-syntax
kleber-swf.ocean-dark-extended
lunaryorn.fish-ide
mechatroner.rainbow-csv
ML2.nc-gcode
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-ssh-edit
ms-vscode.wordcount
naumovs.color-highlight
oderwat.indent-rainbow
redhat.vscode-yaml
shanoor.vscode-nginx
skyapps.fish-vscode
tamasfe.even-better-toml
tht13.html-preview-vscode
timonwong.shellcheck
usernamehw.errorlens
valentjn.vscode-ltex
xaver.clang-format
yzhang.markdown-all-in-one
zxh404.vscode-proto3
