andyyaldoo.vscode-json
auiworks.amvim
ban.spellright
bungcip.better-toml
chrmarti.ssh
coolbear.systemd-unit-file
dougfinke.vscode-pandoc
eamodio.gitlens
emmanuelbeziat.vscode-great-icons
file-icons.file-icons
fireyy.vscode-language-todo
gio00.fish
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hookyqr.beautify
james-yu.latex-workshop
kleber-swf.ocean-dark-extended
lindraupe.aw-watcher-vscode
lunaryorn.fish-ide
mechatroner.rainbow-csv
monofon.pandoc-format
ms-vscode.go
peterjausovec.vscode-docker
quicktype.quicktype
redhat.vscode-yaml
richie5um2.vscode-sort-json
shanoor.vscode-nginx
sidneys1.gitconfig
skyapps.fish-vscode
timonwong.shellcheck
vinzi.wordscounter
wengerk.highlight-bad-chars
yzhang.markdown-all-in-one
zxh404.vscode-proto3
