42crunch.vscode-openapi
anweber.httpbook
anweber.httpbook-grid
anweber.vscode-httpyac
auiworks.amvim
bierner.markdown-mermaid
bmalehorn.vscode-fish
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bufbuild.vscode-buf
continue.continue
davidanson.vscode-markdownlint
dineug.vuerd-vscode
editorconfig.editorconfig
edwinkofler.vscode-assorted-languages
eliostruyf.vscode-front-matter
esbenp.prettier-vscode
exodiusstudios.comment-anchors
fbaligand.vscode-logstash-editor
foxundermoon.shell-format
golang.go
golf1052.base16-generator
hangxingliu.vscode-nginx-conf-hint
hashicorp.terraform
hediet.vscode-drawio
inferrinizzard.prettier-sql-vscode
jeanp413.open-remote-ssh
jeff-hykin.better-dockerfile-syntax
mechatroner.rainbow-csv
mitchdenny.ecdc
mjmlio.vscode-mjml
ms-pyright.pyright
ms-python.black-formatter
ms-python.isort
ms-python.pylint
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
naumovs.color-highlight
nopeslide.vscode-drawio-plugin-mermaid
oderwat.indent-rainbow
pkief.material-icon-theme
pkief.material-product-icons
pomdtr.excalidraw-editor
redhat.vscode-xml
redhat.vscode-yaml
remcohaszing.schemastore
tamasfe.even-better-toml
task.vscode-task
timonwong.shellcheck
tomoki1207.pdf
usernamehw.errorlens
valentjn.vscode-ltex
yzhang.markdown-all-in-one
zxh404.vscode-proto3
