anweber.httpbook
anweber.vscode-httpyac
appliedengdesign.vscode-gcode-syntax
auiworks.amvim
bazelbuild.vscode-bazel
bierner.markdown-mermaid
bmalehorn.vscode-fish
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bufbuild.vscode-buf
editorconfig.editorconfig
edwinkofler.vscode-assorted-languages
eliostruyf.vscode-front-matter
esbenp.prettier-vscode
exodiusstudios.comment-anchors
foxundermoon.shell-format
golang.go
golf1052.base16-generator
hangxingliu.vscode-nginx-conf-hint
hashicorp.hcl
hediet.vscode-drawio
houkanshan.vscode-markdown-footnote
jeanp413.open-remote-ssh
jeff-hykin.better-dockerfile-syntax
joedevivo.vscode-circuitpython
keesschollaart.vscode-home-assistant
mechatroner.rainbow-csv
mitchdenny.ecdc
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-python-envs
ms-vscode.live-server
ms-vscode.vscode-typescript-next
naumovs.color-highlight
nopeslide.vscode-drawio-plugin-mermaid
oderwat.indent-rainbow
opentofu.vscode-opentofu
pkief.material-icon-theme
pkief.material-product-icons
pomdtr.excalidraw-editor
redhat.vscode-xml
redhat.vscode-yaml
remcohaszing.schemastore
renesaarsoo.sql-formatter-vsc
rvben.rumdl
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
usernamehw.errorlens
valentjn.vscode-ltex
yzhang.markdown-all-in-one
