#!/usr/bin/env brew bundle
#
# require:
#   - brew:
#       /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
#   - brew bundle:
#       brew tap homebrew/bundle
#
# execute with:
#   brew bundle
#

### Taps
# Brew
tap "homebrew/core"               # https://github.com/homebrew/homebrew-core
tap "homebrew/bundle"             # https://github.com/Homebrew/homebrew-bundle
tap "homebrew/services"           # https://github.com/Homebrew/homebrew-services
# Cask
tap "homebrew/cask"               # https://github.com/Homebrew/homebrew-cask
tap "homebrew/cask-drivers"       # https://github.com/Homebrew/homebrew-cask-drivers
tap "homebrew/cask-fonts"         # https://github.com/Homebrew/homebrew-cask-fonts
tap "homebrew/cask-versions"      # https://github.com/Homebrew/homebrew-cask-versions
# Custom
tap "buo/cask-upgrade"            # https://github.com/buo/homebrew-cask-upgrade

### Brews
# Shells
brew "fish"                       # https://fishshell.com
brew "bash"                       # https://www.gnu.org/software/bash/ for bash >= v4
# CVS
brew "git"                        # https://git-scm.com
brew "git-lfs"                    # https://github.com/git-lfs/git-lfs
brew "gibo"                       # https://github.com/simonwhitaker/gibo
brew "tig"                        # http://jonas.nitro.dk/tig/
brew "mercurial"                  # https://www.mercurial-scm.org/
# Shell Utils
brew "moreutils"                  # https://joeyh.name/code/moreutils/
brew "coreutils"                  # https://www.gnu.org/software/coreutils/
brew "findutils"                  # https://www.gnu.org/software/findutils/
brew "grep"                       # https://www.gnu.org/software/grep/
brew "binutils"                   # https://www.gnu.org/software/binutils/
brew "gnu-indent"                 # https://www.gnu.org/software/indent/
brew "gnu-sed"                    # https://www.gnu.org/software/sed/
brew "gnu-tar"                    # https://www.gnu.org/software/tar/
brew "pstree"                     # http://www.thp.uni-duisburg.de/pstree/
brew "htop"                       # https://hisham.hm/htop/
brew "tree"                       # http://mama.indstate.edu/users/ice/tree/
brew "wget"                       # https://www.gnu.org/software/wget/
brew "most"                       # http://www.jedsoft.org/most/
brew "vim"                        # http://www.vim.org/
brew "dtrx"                       # http://brettcsmith.org/2007/dtrx/
brew "grc"                        # http://kassiopeia.juls.savba.sk/~garabik/software/grc.html
brew "pv"                         # https://www.ivarch.com/programs/pv.shtml
brew "trash"                      # https://github.com/ali-rantakari/trash
brew "rlwrap"                     # http://utopia.knoware.nl/~hlub/rlwrap/
brew "pwgen"                      # https://pwgen.sourceforge.io/
brew "ripgrep"                    # https://github.com/BurntSushi/ripgrep
brew "fd"                         # https://github.com/sharkdp/fd
# Programming
brew "node"                       # https://nodejs.org/
brew "perl"                       # https://www.perl.org/
brew "go"                         # https://golang.org
brew "dep"                        # https://github.com/golang/dep
brew "python@2"                   # https://www.python.org/
brew "python@3"                   # https://www.python.org/
brew "ipython"                    # https://ipython.org/
brew "flake8"                     # http://flake8.pycqa.org/
brew "shellcheck"                 # http://www.shellcheck.net/
brew "grpc"                       # http://www.grpc.io/
brew "protobuf"                   # https://github.com/google/protobuf
# Network tools
brew "iftop"                      # http://www.ex-parrot.com/pdw/iftop/
brew "nmap"                       # https://nmap.org/
brew "mtr"                        # http://www.bitwizard.nl/mtr/
# DevOps
brew "awscli"                     # https://github.com/aws/aws-cli
cask "aws-vault"                  # https://github.com/99designs/aws-vault
brew "versent/taps/saml2aws"      # https://github.com/Versent/saml2aws
brew "wrk"                        # https://github.com/wg/wrk
brew "httpie"                     # https://httpie.org/
brew "mitmproxy"                  # https://mitmproxy.org/
brew "docker-credential-helper-ecr" # https://github.com/awslabs/amazon-ecr-credential-helper
brew "kubernetes-cli"             # https://kubernetes.io/docs/tasks/tools/install-kubectl/
brew "kubernetes-helm"            # https://helm.sh/
# Backup
brew "restic"                     # https://github.com/restic/restic
brew "rclone"                     # https://rclone.org/
# Other
brew "pandoc"                     # http://pandoc.org
brew "jq"                         # https://stedolan.github.io/jq/
brew "aria2"                      # https://aria2.github.io/
brew "aspell"                     # http://aspell.net/
brew "keychain"                   # https://www.funtoo.org/Keychain
# Brew utils
brew "mas"                        # https://github.com/mas-cli/mas

### Casks
# Fonts
cask "font-monofur"               # http://www.dafont.com/monofur.font
cask "font-monofur-for-powerline" # https://github.com/powerline/fonts/tree/master/Monofur
cask "font-lato"                  # http://www.dafont.com/monofur.font
cask "font-go-mono"               # https://go.googlesource.com/image/+/master/font/gofont/ttfs/README
cask "font-nova-mono"             # https://fonts.google.com/specimen/Nova+Mono
cask "font-monoid"                # https://github.com/larsenwork/monoid
cask "font-hack"                  # https://sourcefoundry.org/hack/
cask "font-hasklig"               # https://github.com/i-tu/Hasklig/
cask "font-hasklig-nerd-font"     # https://github.com/ryanoasis/nerd-fonts/tree/master/patched-fonts/Hasklig
# Network tools
cask "wireshark"                  # https://www.wireshark.org/
cask "tuntap"                     # http://tuntaposx.sourceforge.net/faq.xhtml
cask "horndis"                    # http://joshuawise.com/horndis
cask "viscosity"                  # https://www.sparklabs.com/viscosity/
cask "james"                      # https://github.com/james-proxy/james
cask "protonvpn"                  # https://protonvpn.com/
# Virtualisation
cask "virtualbox"                 # https://www.virtualbox.org/
cask "virtualbox-extension-pack"  # https://www.virtualbox.org/
cask "docker"                     # https://docs.docker.com/engine/installation/mac/
# Database
cask "jeromelebel-mongohub"       # https://github.com/jeromelebel/MongoHub-Mac
cask "sequel-pro"                 # https://sequelpro.com/
cask "postico"                    # https://eggerapps.at/postico/
cask "tableplus"                  # https://tableplus.io/
# Media Playback
cask "spotify"                    # https://www.spotify.com/
cask "vlc"                        # http://www.videolan.org/vlc/
cask "simple-comic"               # http://dancingtortoise.com/simplecomic/
cask "molotov"                    # https://www.molotov.tv/
# Encryption
cask "yubico-yubikey-manager"     # https://developers.yubico.com/yubikey-manager-qt/
cask "keybase"                    # https://keybase.io/
cask "gpg-suite"                  # https://gpgtools.org/
cask "keepassxc"                  # https://keepassxc.org/
# Storage
cask "osxfuse"                    # https://osxfuse.github.io/
cask "veracrypt"                  # https://veracrypt.codeplex.com/
cask "cyberduck"                  # https://cyberduck.io/
# Programming
cask "iterm2"                     # https://iterm2.com/downloads.html
cask "visual-studio-code"         # https://code.visualstudio.com/
cask "insomnia"                   # https://insomnia.rest/
cask "hex-fiend"                  # https://github.com/ridiculousfish/HexFiend/
cask "arduino"                    # https://www.arduino.cc/
cask "meld"                       # http://meldmerge.org/
# Media Editor
cask "basictex"                   # https://www.tug.org/mactex/
cask "yed"                        # http://www.yworks.com/en/downloads.html#yEd
cask "gimp"                       # http://www.gimp.org/
cask "standard-notes"             # http://standardnotes.org/
cask "numi"                       # http://numi.io/
cask "marp"                       # https://marpit.marp.app/
# Web
cask "transmission"               # http://www.transmissionbt.com/download/
cask "firefox-developer-edition"  # https://www.mozilla.org/en-US/firefox/
cask "thunderbird"                # https://www.thunderbird.net/
cask "google-chrome"              # https://www.google.com/chrome/index.html
cask "eloston-chromium"           # https://github.com/Eloston/ungoogled-chromium
# Social
cask "rambox"                     # http://rambox.pro/
cask "textual"                    # https://www.codeux.com/textual/
# Game
cask "steam"                      # ttp://store.steampowered.com/
# Tray
cask "hammerspoon"                # http://www.hammerspoon.org/'
cask "flux"                       # https://justgetflux.com/
cask "boom-3d"                    # http://www.globaldelight.com/boom3d/
cask "bartender"                  # https://www.macbartender.com/
cask "istat-menus"                # https://bjango.com/mac/istatmenus/
# Utils
cask "java"                       # https://support.apple.com/kb/DL1572
cask "flash-player"               # https://get.adobe.com/flashplayer/
cask "android-file-transfer"      # https://android.com/filetransfer/
cask "android-platform-tools"     # https://developer.android.com/sdk
cask "appcleaner"                 # http://freemacsoft.net/appcleaner/
cask "balenaetcher"               # https://www.balena.io/etcher/
cask "karabiner-elements"         # https://pqrs.org/osx/karabiner/
cask "logitech-options"           # http://support.logitech.com/en_us/product/wireless-mouse-m335
cask "qmk-toolbox"                # https://qmk.fm/toolbox/
cask "boinc"                      # https://boinc.berkeley.edu/wiki/BOINC_Manager

### AppStore
mas "Pages", id: 409201541        # https://www.apple.com/pages/
mas "Numbers", id: 409203825      # https://www.apple.com/numbers/
mas "Keynote", id: 409183694      # https://www.apple.com/keynote/
mas "Reeder", id: 880001334       # http://reederapp.com/
mas "WireGuard", id: 1451685025   # https://www.wireguard.com/
# mas "Xcode", id: 497799835      # https://developer.apple.com/xcode/

### Non Brew software
# Photoshop CC                    # https://www.adobe.com/products/photoshop.html
# Illustrator CC                  # https://www.adobe.com/products/illustrator.html
# MS Office                       # https://portal.office.com/OLS/MySoftware.aspx
# Audacity                        # https://www.audacityteam.org/
# Medis                           # git clone https://github.com/luin/medis.git && npm run pack
# Hey                             # go get -u github.com/rakyll/hey
# GRPCurl                         # go get -u -v github.com/fullstorydev/grpcurl/cmd/grpcurl
# Flotato for Netflix             # https://flotato.com/

### 3D Printing
cask "prusa-slic3r"               # https://github.com/prusa3d/Slic3r
cask "repetier-host"              # https://www.repetier.com/
cask "openscad"                   # https://www.openscad.org/
# Autodesk Fusion 360             # https://www.autodesk.com/campaigns/fusion-360-for-hobbyists
# fstl                            # https://github.com/mkeeter/fstl
# pronterface.app                 # Fetch from Prusa Drivers bundle at https://www.prusa3d.com/drivers/

### Keyboard shortcut
# CTRL+CMD+left : Desktop left
# CTRL+CMD+Right: Desktop right
# CTRL+CMD+Up   : Mission Control
# CTRL+CMD+Down : App Expose
### Mouse Shortcut
# Gesture+Left  : Desktop left  (as keyboard input)
# Gesture+Right : Desktop right (as keyboard input)
# Gesture+Up    : Mission Control
# Gesture+Down  : App Expose
# ScrollLeft    : Forward
# ScrollRight   : Back
