#!/usr/bin/env brew bundle
#
# require:
#   - brew:
#       /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
#   - brew bundle:
#       brew tap homebrew/bundle
#
# execute with:
#   brew bundle
#

### Taps
tap "homebrew/bundle"             # https://github.com/Homebrew/homebrew-bundle
tap "homebrew/services"           # https://github.com/Homebrew/homebrew-services
tap "homebrew/dupes"              # https://github.com/Homebrew/homebrew-dupes
tap "homebrew/aliases"            # https://github.com/Homebrew/homebrew-aliases
tap "homebrew/fuse"               # https://github.com/Homebrew/homebrew-fuse
tap "caskroom/cask"               # https://github.com/caskroom/homebrew-cask
tap "caskroom/fonts"              # https://github.com/caskroom/homebrew-fonts
tap "caskroom/versions"           # https://github.com/caskroom/homebrew-versions
tap "buo/cask-upgrade"            # https://github.com/buo/homebrew-cask-upgrade
tap "drone/drone"                 # https://github.com/drone/homebrew-drone
tap "mickep76/funk-gnarge"        # https://github.com/mickep76/homebrew-funk-gnarge

### Aliases
# brew alias 'fu=!brew upgrade;brew cu;brew cleanup;brew cask cleanup'

### Brews
# Shells
brew "fish"                       # https://fishshell.com
brew "bash"                       # https://www.gnu.org/software/bash/ for bash >= v4
# CVS
brew "git"                        # https://git-scm.com
brew "git-flow"                   # https://github.com/nvie/gitflow
brew "git-lfs"                    # https://github.com/git-lfs/git-lfs
brew "gibo"                       # https://github.com/simonwhitaker/gibo
brew "tig"                        # http://jonas.nitro.dk/tig/
brew "mr"                         # https://myrepos.branchable.com/
brew "mercurial"                  # https://www.mercurial-scm.org/
# Shell Utils
brew "moreutils"                  # https://joeyh.name/code/moreutils/
brew "coreutils"                  # https://www.gnu.org/software/coreutils/
brew "findutils"                  # https://www.gnu.org/software/findutils/
brew "grep"                       # https://www.gnu.org/software/grep/
brew "binutils"                   # https://www.gnu.org/software/binutils/
brew "gnu-indent"                 # https://www.gnu.org/software/indent/
brew "gnu-sed"                    # https://www.gnu.org/software/sed/
brew "gnu-tar"                    # https://www.gnu.org/software/tar/
brew "pstree"                     # http://www.thp.uni-duisburg.de/pstree/
brew "htop"                       # https://hisham.hm/htop/
brew "tree"                       # http://mama.indstate.edu/users/ice/tree/
brew "wget"                       # https://www.gnu.org/software/wget/
brew "most"                       # http://www.jedsoft.org/most/
brew "vim"                        # http://www.vim.org/
brew "dtrx"                       # http://brettcsmith.org/2007/dtrx/
brew "grc"                        # http://kassiopeia.juls.savba.sk/~garabik/software/grc.html
brew "pv"                         # https://www.ivarch.com/programs/pv.shtml
brew "apg"                        # [http://www.adel.nursat.kz/apg/]
brew "trash"                      # https://github.com/ali-rantakari/trash
brew "rlwrap"                     # http://utopia.knoware.nl/~hlub/rlwrap/
# Programming
brew "node"                       # https://nodejs.org/
brew "perl"                       # https://www.perl.org/
brew "go"                         # https://golang.org
brew "python"                     # https://www.python.org/
brew "python3"                    # https://www.python.org/
brew "shellcheck"                 # http://www.shellcheck.net/
# Network tools
brew "iftop"                      # http://www.ex-parrot.com/pdw/iftop/
brew "nmap"                       # https://nmap.org/
brew "mtr"                        # http://www.bitwizard.nl/mtr/
brew "nghttp2"                    # https://nghttp2.org/
# DevOps
brew "awscli"                     # https://github.com/aws/aws-cli
brew "minio-mc"                   # https://github.com/minio/mc
brew "drone"                      # https://github.com/drone/drone/
brew "rancher-cli"                # https://github.com/rancher/cli
brew "rancher-compose"            # https://github.com/rancher/rancher-compose
brew "etcd"                       # https://github.com/coreos/etcd
brew "etcdtool"                   # https://github.com/mickep76/etcdtool
brew "wrk"                        # https://github.com/wg/wrk

# Other
brew "asciinema"                  # https://asciinema.org/
brew "android-platform-tools"     # https://developer.android.com/sdk
brew "pandoc"                     # http://pandoc.org
brew "micro"                      # ? # https://github.com/zyedidia/micro
brew "speedtest_cli"              # https://github.com/sivel/speedtest-cli
brew "vbindiff"                   # https://www.cjmweb.net/vbindiff/
brew "jq"                         # https://stedolan.github.io/jq/
brew "ack"                        # http://beyondgrep.com/
brew "gnupg2"                     # ettps://www.gnupg.orge
# Brew & Cask utils
brew "vitorgalvao/tiny-scripts/cask-repair" # https://github.com/caskroom/homebrew-cask/blob/master/CONTRIBUTING.md#updating-a-cask

### Casks
# Fonts
cask "font-monofur"               # http://www.dafont.com/monofur.font
cask "font-monofur-for-powerline" # https://github.com/powerline/fonts/tree/master/Monofur
# Network ttols
cask "wireshark"                  # https://www.wireshark.org/
cask "tuntap"                     # http://tuntaposx.sourceforge.net/faq.xhtml
cask "horndis"                    # http://joshuawise.com/horndis
cask "viscosity"                  # https://www.sparklabs.com/viscosity/
cask "nordvpn"                    # http://nordvpn.com/
# Virtualisation
cask "virtualbox"                 # https://www.virtualbox.org/
cask "docker-beta"                # https://docs.docker.com/engine/installation/mac/
cask "kitematic"                  # https://kitematic.com/
cask "vagrant"                    # https://www.vagrantup.com/
# Database
cask "mongohub"                   # https://github.com/jeromelebel/MongoHub-Mac
cask "devcenter"                  # http://www.planetcassandra.org/devcenter/
cask "psequel"                    # http://www.psequel.com/
cask "sequel-pro"                 # https://sequelpro.com/
cask "spotify"                    # https://www.spotify.com/
# Media Visualisation
cask "vlc"                        # http://www.videolan.org/vlc/
cask "airflow"                    # http://airflowapp.com/
# Encryption
cask "yubikey-neo-manager"        # http://yubico.com/
cask "yubikey-personalization-gui"# http://yubico.com/
cask "osxfuse"                    # https://osxfuse.github.io/
cask "veracrypt"                  # https://veracrypt.codeplex.com/
cask "eldeveloper-macfusion"      # https://github.com/ElDeveloper/macfusion2/
cask "keybase"                    # https://keybase.io/
cask "gpgtools"                   # https://gpgtools.org/
cask "macpass"                    # https://github.com/mstarke/MacPass/ + https://github.com/MacPass/MacPassHTTP
# Programming
cask "iterm2-beta"                # https://iterm2.com/downloads.html
cask "atom"                       # http://atom.io/
cask "insomnia"                   # https://insomnia.rest/
cask "Hex-fiend"                  # https://github.com/ridiculousfish/HexFiend/
# Media Edit
cask "basictex"                   # https://www.tug.org/mactex/
cask "yed"                        # http://www.yworks.com/en/downloads.html#yEd
cask "gimp"                       # http://www.gimp.org/
cask "macdown"                    # http://macdown.uranusjr.com/
cask "numi"                       # http://numi.io/
# Web
cask "transmission"               # http://www.transmissionbt.com/download/
cask "skype"                      # https://www.skype.com/en/download-skype/skype-for-computer/
cask "airmail-beta"               # http:airmailapp.com/beta
cask "waterfox"                   # http://waterfoxproject.org/
cask "forklift-beta"              # http://www.binarynights.com/
# Social
cask "franz"                      # http://meetfranz.com/
cask "textual"                    # https://www.codeux.com/textual/
cask "slack"                      # ttps://slack.com/
# Game
cask "steam"                      # ? # http://store.steampowered.com/
# Tray
cask "keepingyouawake"            # https://github.com/newmarcel/KeepingYouAwake/releases
cask "flux"                       # https://justgetflux.com/
cask "boom"                       # http://www.globaldelight.com/boom/
cask "gitify"                     # http://gitify.io/
cask "ccmenu"                     # https://github.com/erikdoe/ccmenu/
# Utils
cask "java6"                      # https://support.apple.com/kb/DL1572
cask "flash-player"               # https://get.adobe.com/flashplayer/
cask "android-file-transfer"      # https://android.com/filetransfer/
cask "appcleaner"                 # http://freemacsoft.net/appcleaner/
cask "etcher"                     # https://etcher.io/
cask "karabiner-elements"         # https://pqrs.org/osx/karabiner/

### Non Brew software
# Photoshop CC                    # https://www.adobe.com/products/photoshop.html
# Illustrator CC                  # https://www.adobe.com/products/illustrator.html
# Fantastical 2                   # AppStore
# Reeder 3                        # AppStore
# XCode                           # AppStore
# Office 2016                     # https://portal.office.com/OLS/MySoftware.aspx
# Habitica-GUI                    # https://github.com/0rax/habitica-gui
# HackMD-GUI                      # https://github.com/0rax/hackmd-gui
