#!/usr/bin/env brew bundle
#
# require:
#   - brew:
#       /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
#   - brew bundle:
#       brew tap homebrew/bundle
#
# execute with:
#   brew bundle
#

### Taps
# Brew
tap "homebrew/core"               # https://github.com/homebrew/homebrew-core
tap "homebrew/bundle"             # https://github.com/Homebrew/homebrew-bundle
tap "homebrew/aliases"            # https://github.com/Homebrew/homebrew-aliases
tap "homebrew/services"           # https://github.com/Homebrew/homebrew-services
tap "homebrew/dupes"              # https://github.com/Homebrew/homebrew-dupes
tap "homebrew/fuse"               # https://github.com/Homebrew/homebrew-fuse
# Cask
tap "caskroom/cask"               # https://github.com/caskroom/homebrew-cask
tap "caskroom/drivers"            # https://github.com/caskroom/homebrew-drivers
tap "caskroom/fonts"              # https://github.com/caskroom/homebrew-fonts
tap "caskroom/versions"           # https://github.com/caskroom/homebrew-versions
# Custom
tap "buo/cask-upgrade"            # https://github.com/buo/homebrew-cask-upgrade

### Aliases
# brew alias fc='cleanup; brew cask cleanup'
# brew alias fu='update; brew upgrade; brew cu -a'

### Brews
# Shells
brew "fish"                       # https://fishshell.com
brew "bash"                       # https://www.gnu.org/software/bash/ for bash >= v4
# CVS
brew "git"                        # https://git-scm.com
brew "git-flow"                   # https://github.com/nvie/gitflow
brew "git-lfs"                    # https://github.com/git-lfs/git-lfs
brew "gibo"                       # https://github.com/simonwhitaker/gibo
brew "tig"                        # http://jonas.nitro.dk/tig/
brew "mercurial"                  # https://www.mercurial-scm.org/
brew "hub"                        # https://github.com/github/hub
# Shell Utils
brew "moreutils"                  # https://joeyh.name/code/moreutils/
brew "coreutils"                  # https://www.gnu.org/software/coreutils/
brew "findutils"                  # https://www.gnu.org/software/findutils/
brew "grep"                       # https://www.gnu.org/software/grep/
brew "binutils"                   # https://www.gnu.org/software/binutils/
brew "gnu-indent"                 # https://www.gnu.org/software/indent/
brew "gnu-sed"                    # https://www.gnu.org/software/sed/
brew "gnu-tar"                    # https://www.gnu.org/software/tar/
brew "pstree"                     # http://www.thp.uni-duisburg.de/pstree/
brew "htop"                       # https://hisham.hm/htop/
brew "tree"                       # http://mama.indstate.edu/users/ice/tree/
brew "wget"                       # https://www.gnu.org/software/wget/
brew "most"                       # http://www.jedsoft.org/most/
brew "vim"                        # http://www.vim.org/
brew "dtrx"                       # http://brettcsmith.org/2007/dtrx/
brew "grc"                        # http://kassiopeia.juls.savba.sk/~garabik/software/grc.html
brew "pv"                         # https://www.ivarch.com/programs/pv.shtml
brew "trash"                      # https://github.com/ali-rantakari/trash
brew "rlwrap"                     # http://utopia.knoware.nl/~hlub/rlwrap/
brew "pwgen"                      # https://pwgen.sourceforge.io/
# Programming
brew "node"                       # https://nodejs.org/
brew "perl"                       # https://www.perl.org/
brew "go"                         # https://golang.org
brew "dep"                        # https://github.com/golang/dep
brew "godep"                      # github.com/tools/godep
brew "python@2"                   # https://www.python.org/
brew "python@3"                   # https://www.python.org/
brew "shellcheck"                 # http://www.shellcheck.net/
brew "grpc"                       # http://www.grpc.io/
brew "protobuf"                   # https://github.com/google/protobuf
# Network tools
brew "iftop"                      # http://www.ex-parrot.com/pdw/iftop/
brew "nmap"                       # https://nmap.org/
brew "mtr"                        # http://www.bitwizard.nl/mtr/
# DevOps
brew "awscli"                     # https://github.com/aws/aws-cli
brew "minio-mc"                   # https://github.com/minio/mc
brew "rancher-cli"                # https://github.com/rancher/cli
brew "rancher-compose"            # https://github.com/rancher/rancher-compose
brew "mickep76/funk-gnarge/etcdtool" # https://github.com/mickep76/etcdtool
brew "wrk"                        # https://github.com/wg/wrk
brew "httpie"                     # https://httpie.org/
brew "scaleway/scaleway/scw"      # https://github.com/scaleway/scaleway-cli
brew "mitmproxy"                  # https://mitmproxy.org/
# Other
brew "android-platform-tools"     # https://developer.android.com/sdk
brew "pandoc"                     # http://pandoc.org
brew "jq"                         # https://stedolan.github.io/jq/
brew "ripgrep"                    # https://github.com/BurntSushi/ripgrep
brew "aria2"                      # https://aria2.github.io/
brew "aspell"                     # http://aspell.net/
# Brew utils
brew "mas"                        # https://github.com/mas-cli/mas
brew "vitorgalvao/tiny-scripts/cask-repair" # https://github.com/caskroom/homebrew-cask/blob/master/CONTRIBUTING.md#updating-a-cask

### Casks
# Fonts
cask "font-monofur"               # http://www.dafont.com/monofur.font
cask "font-monofur-for-powerline" # https://github.com/powerline/fonts/tree/master/Monofur
cask "font-lato"                  # http://www.dafont.com/monofur.font
cask "font-go-mono"               # https://go.googlesource.com/image/+/master/font/gofont/ttfs/README
cask "font-nova-mono"             # https://fonts.google.com/specimen/Nova+Mono
cask "font-monoid"                # ? # https://github.com/larsenwork/monoid
cask "font-hack"                  # ? # https://sourcefoundry.org/hack/
cask "font-hasklig"               # ? # https://github.com/i-tu/Hasklig/

# Network tools
cask "wireshark"                  # https://www.wireshark.org/
cask "tuntap"                     # http://tuntaposx.sourceforge.net/faq.xhtml
cask "horndis"                    # http://joshuawise.com/horndis
cask "viscosity"                  # https://www.sparklabs.com/viscosity/
# Virtualisation
cask "virtualbox"                 # https://www.virtualbox.org/
cask "docker-edge"                # https://docs.docker.com/engine/installation/mac/
cask "vagrant"                    # https://www.vagrantup.com/
# Database
cask "mongohub"                   # https://github.com/jeromelebel/MongoHub-Mac
cask "sequel-pro"                 # https://sequelpro.com/
cask "postico"                    # https://eggerapps.at/postico/
# Media Playback
cask "spotify"                    # https://www.spotify.com/
cask "vlc"                        # http://www.videolan.org/vlc/
cask "simple-comic"               # http://dancingtortoise.com/simplecomic/
# Encryption
cask "yubikey-manager"            # https://developers.yubico.com/yubikey-manager-qt/
cask "yubico-authenticator"       # https://developers.yubico.com/yubioath-desktop/
cask "keybase"                    # https://keybase.io/
cask "gpg-suite"                  # https://gpgtools.org/
cask "macpass"                    # https://github.com/mstarke/MacPass/ + https://github.com/MacPass/MacPassHTTP
# Storage
cask "osxfuse"                    # https://osxfuse.github.io/
cask "veracrypt"                  # https://veracrypt.codeplex.com/
cask "hubic"                      # https://hubic.com/home/
cask "forklift2"                  # https://www.binarynights.com/forklift/
# Programming
cask "iterm2-beta"                # https://iterm2.com/downloads.html
cask "atom"                       # http://atom.io/
cask "insomnia"                   # https://insomnia.rest/
cask "hex-fiend"                  # https://github.com/ridiculousfish/HexFiend/
cask "arduino"                    # https://www.arduino.cc/
cask "fork"                       # https://git-fork.com/
# Media Edit
cask "basictex"                   # https://www.tug.org/mactex/
cask "yed"                        # http://www.yworks.com/en/downloads.html#yEd
cask "gimp"                       # http://www.gimp.org/
cask "hackmd"                     # https://github.com/hackmdio/hackmd-desktop
cask "numi"                       # http://numi.io/
# Web
cask "transmission"               # http://www.transmissionbt.com/download/
cask "skype"                      # https://www.skype.com/en/download-skype/skype-for-computer/
cask "airmail-beta"               # http:airmailapp.com/beta
cask "firefoxdeveloperedition"    # https://www.mozilla.org/en-US/firefox/
cask "google-chrome"              # https://www.google.com/chrome/index.html
# Social
cask "rambox"                     # http://rambox.pro/
cask "textual"                    # https://www.codeux.com/textual/
cask "slack"                      # ttps://slack.com/
# Game
cask "steam"                      # ttp://store.steampowered.com/
# Blockchain
cask "mist"                       # https://github.com/ethereum/mist/releases
# Tray
cask "hammerspoon"                # http://www.hammerspoon.org/'
cask "flux"                       # https://justgetflux.com/
cask "boom-3d"                    # http://www.globaldelight.com/boom3d/
cask "gitify"                     # http://gitify.io/
cask "ccmenu"                     # https://github.com/erikdoe/ccmenu/
cask "bartender"                  # https://www.macbartender.com/
cask "istat-menus"                # https://bjango.com/mac/istatmenus/
# Utils
cask "java6"                      # https://support.apple.com/kb/DL1572
cask "flash-player"               # https://get.adobe.com/flashplayer/
cask "android-file-transfer"      # https://android.com/filetransfer/
cask "appcleaner"                 # http://freemacsoft.net/appcleaner/
cask "etcher"                     # https://etcher.io/
cask "karabiner-elements"         # https://pqrs.org/osx/karabiner/
cask "logitech-options"           # http://support.logitech.com/en_us/product/wireless-mouse-m335

### AppStore
mas "Pages", id: 409201541        # https://www.apple.com/pages/
mas "Numbers", id: 409203825      # https://www.apple.com/numbers/
mas "Keynote", id: 409183694      # https://www.apple.com/keynote/
mas "Reeder", id: 880001334       # http://reederapp.com/
# mas "Xcode", id: 497799835        # https://developer.apple.com/xcode/

### Non Brew software
# Photoshop CC                    # https://www.adobe.com/products/photoshop.html
# Illustrator CC                  # https://www.adobe.com/products/illustrator.html
# Office 2016                     # https://portal.office.com/OLS/MySoftware.aspx
# Drone CLI                       # http://readme.drone.io/0.5/install/cli/
# grpcc                           # npm install -g grpcc
# etcdctl                         # go get -u -v github.com/coreos/etcd/etcdctl
# Medis                           # git clone https://github.com/luin/medis.git && npm run pack

### Testing
brew "micro"                      # https://github.com/zyedidia/micro
cask "standard-notes"             # http://standardnotes.org/
cask "tableplus"                  # https://tableplus.io/
cask "sketch"                     # http://sketchapp.com/
brew "ncdu"                       # https://dev.yorhel.nl/ncdu

## Keyboard shortcut
# CTRL+CMD+left : Desktop left
# CTRL+CMD+Right: Desktop right
# CTRL+CMD+Up   : Mission Control
# CTRL+CMD+Down : App Expose
## Mouse Shortcut
# Gesture+Left  : Desktop left  (as keyboard input)
# Gesture+Right : Desktop right (as keyboard input)
# Gesture+Up    : Mission Control
# Gesture+Down  : App Expose
# ScrollLeft    : Forward
# ScrollRight   : Back

## Firefox about:config
# extension.pocket.enabled = false
# xpinstall.signatures.required = false
# security.webauth.u2f = false

# http://www.airsquirrels.com/airparrot/
